package com.ecust.app.dws;

/**
 * 交易域支付各窗口汇总表
 * 10.7.1 主要任务
 * 从 Kafka 读取交易域支付成功主题数据，统计支付成功独立用户数和首次支付成功用户数。
 * （1）从 Kafka 支付成功明细主题读取数据
 * （2）转换数据结构 String 转换为 JSONObject。
 * （3）按照唯一键分组
 * （4）去重
 * （5）设置水位线，按照 user_id 分组
 * （6）统计独立支付人数和新增支付人数	 运用 Flink 状态编程，在状态中维护用户末次支付日期。
 * 若末次支付日期为 null，则将首次支付用户数和支付独立用户数均置为 1；否则首次支付用户数置为 0，判断末次支付日期是否为当日，如果不是当日则支付独立用户数置为 1，否则置为 0。最后将状态中的支付日期更新为当日。
 * （7）开窗、聚合 度量字段求和，补充窗口起始时间和结束时间字段，ts 字段置为当前系统时间戳。
 * （8）写出到 ClickHouse
 */
public class DwsTradePaymentSucWindow {
    public static void main(String[] args) {

    }
}
